{
  "backend/main.mo": "Main Motoko actor defining Product and Order types with CRUD operations including getProduct, getAllProducts, placeOrder, getOrder, updateOrderStatus, and getOrderStatus using Map-based storage.",
  "backend/migration.mo": "Migration module that seeds three default clothing products (denim jacket, maxi dress, chinos) into a new products map while preserving existing orders and order ID counter from the old actor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, affected files, components, test IDs, and confidence levels for the ZAYORA clothing brand app.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file's purpose and content for the ZAYORA clothing e-commerce application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the Zayora React app with a root div and module script entry point pointing to src/main.tsx.",
  "frontend/src/App.tsx": "Root React component managing view state (home, checkout, confirmation) and rendering all page sections or the appropriate checkout/confirmation flow based on user interaction.",
  "frontend/src/components/AnnouncementBanner.tsx": "Scrolling announcement banner with a fashion-themed promotional message, orange-blue gradient background, and a live countdown timer showing hours, minutes, and seconds.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form collecting customer name, phone, and address with validation, displaying an order summary with MRP and delivery charge, and submitting the order via the usePlaceOrder hook.",
  "frontend/src/components/ComingSoonSection.tsx": "Renders a promotional banner announcing Zayora's upcoming availability on Blinkit, displaying the Blinkit logo and a brief description.",
  "frontend/src/components/ContactFooter.tsx": "Renders the site footer with Zayora brand info, contact details (phone, WhatsApp, email), quick navigation links, and a copyright bar.",
  "frontend/src/components/HeroSection.tsx": "Renders the top hero banner for Zayora with a gradient background, brand tagline, and CTA buttons linking to products and contact sections.",
  "frontend/src/components/OrderConfirmation.tsx": "Displays order confirmation details after a successful purchase, including product info, customer details, total amount, and a WhatsApp notification button to the seller.",
  "frontend/src/components/PartnerLogos.tsx": "Renders a 'Featured On' section displaying logos of partner platforms: YouTube, Bharat Ke Founder, MX Player, and PhonePe.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with image, name, MRP, description, feature list, and a Cash on Delivery checkout button.",
  "frontend/src/components/ProductReviews.tsx": "Renders a customer reviews section with five hardcoded reviews displayed in a grid, each showing star rating, review text, and reviewer name.",
  "frontend/src/components/ProductShowcase.tsx": "Fetches and displays all products in a responsive grid using ProductCard components, with loading and error states handled.",
  "frontend/src/components/RestaurantSection.tsx": "Renders a promotional banner section highlighting Zayora's company-owned restaurant 'ALL IS WELL .KANPUR' in Kanpur.",
  "frontend/src/components/VideoSection.tsx": "Embeds a YouTube video in a responsive 16:9 iframe to showcase the Zayora brand story.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Custom hook that implements a 24-hour countdown timer, decrementing every second and resetting when it reaches zero, returning hours, minutes, and seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity state tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, a single product, placing an order, and fetching an order via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines OKLCH-based CSS custom properties for light and dark themes, and adds a scrolling marquee animation.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based color tokens, custom orange and blue palettes, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the Zayora clothing/apparel brand website, including architectural notes, existing features, known issues, and image requirements for the e-commerce frontend."
}