{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting six implemented features including homepage layout, company information, product showcase, partner logos, Blinkit coming soon section, and contact information with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their purpose and functionality in the Zayora website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode variables with neutral grayscale palette (no orange theme applied at root level).",
  "frontend/index.html": "HTML entry point for the Zayora application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component composing the full page layout with hero, product showcase, partner logos, coming soon, and contact footer sections.",
  "frontend/src/components/ComingSoonSection.tsx": "Orange gradient section announcing upcoming Blinkit partnership with clock icon, heading, description, and Blinkit logo display.",
  "frontend/src/components/ContactFooter.tsx": "Footer component displaying Zayora brand info, founder name (Yash Jaiswal), contact details (phone: 9919031626, email: zayora11@gmail.com), quick links, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/HeroSection.tsx": "Hero section with orange gradient background featuring Zayora brand name, founder attribution (Yash Jaiswal), tagline, and CTA buttons for products and contact.",
  "frontend/src/components/PartnerLogos.tsx": "Partner logos section displaying YouTube, Bharat Ke Founder, and MX Player logos in a responsive grid with hover effects.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component with image, name, description, and feature list with checkmarks, styled with orange accents and hover effects.",
  "frontend/src/components/ProductShowcase.tsx": "Product showcase section rendering two ProductCard components for Bluetooth Earbuds and Smart Watch with descriptions and features in a responsive grid.",
  "frontend/src/hooks/useActor.ts": "React hook managing authenticated and anonymous backend actor instances using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks to interact with backend; currently empty as no backend functionality is needed for the static website.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system including light/dark themes, color palette (orange-focused), and smooth scroll behavior.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH color system, container settings, custom orange palette, border radius variables, and animation keyframes.",
  "project_state.json": "Project metadata defining Zayora website requirements including orange tech theme, product showcase for earbuds/smartwatches, partner logos (YouTube, Bharat Ke Founder, MX Player, Blinkit), contact info, and image asset specifications."
}