{
  "backend/main.mo": "Motoko actor defining Product and Order types with in-memory storage, providing query/update functions for product retrieval, order placement with ₹50 delivery charge, and order status management; initializes three hardcoded products including BlueX1 earbuds at ₹499.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: adding the BlueX1 earbuds product, cash-on-delivery checkout with ₹50 delivery charge, backend product fetching, and static asset rendering for product images.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component responsibilities, styling approach with OKLCH orange color system, and React Query integration for backend communication.",
  "frontend/index.css": "Tailwind CSS base layer defining design tokens using OKLCH color space with neutral grayscale values and chart colors for both light and dark modes.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Zayora' title, and script reference to main.tsx React application.",
  "frontend/src/App.tsx": "Root React component managing view state (home/checkout/confirmation) and navigation flow between product showcase, checkout form, and order confirmation with smooth scrolling.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form component with validation for name, address, and 10-digit phone; displays order summary with product details, MRP, ₹50 delivery charge breakdown, and handles order placement via usePlaceOrder hook.",
  "frontend/src/components/ComingSoonSection.tsx": "Orange gradient section announcing upcoming Blinkit partnership with Clock icon, heading, description, and Blinkit logo image.",
  "frontend/src/components/ContactFooter.tsx": "Footer displaying Zayora brand info with founder name, contact details (phone 9919031626, email zayora11@gmail.com), quick links, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying ZAYORA branding with gradient orange background, founder attribution, and call-to-action buttons for exploring products and contact.",
  "frontend/src/components/OrderConfirmation.tsx": "Order confirmation page component that fetches and displays order details including customer info, product breakdown, delivery charges, and order status with loading and error states.",
  "frontend/src/components/PartnerLogos.tsx": "Displays a grid of partner/featured platform logos (YouTube, Bharat Ke Founder, MX Player) with hover effects.",
  "frontend/src/components/ProductCard.tsx": "Product card component showing product image, name, MRP, features list, and a cash-on-delivery checkout button with disabled state for unavailable products.",
  "frontend/src/components/ProductShowcase.tsx": "Product listing section that fetches and displays all products in a responsive grid with loading, error, and empty states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching products, placing orders, and retrieving order details using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using an orange-based design system.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color palette using OKLCH color space (including orange shades, sidebar, chart colors), container settings, border radius variables, and animation keyframes for accordions and other UI elements.",
  "project_state.json": "Project state tracking file documenting Zayora's e-commerce website features including product showcase (earbuds, smartwatches), partner logos, contact info, cash-on-delivery checkout with ₹50 delivery charge, and architectural notes about the orange-themed tech product site."
}