{
  "backend/main.mo": "Motoko actor defining Product and Order types with CRUD operations for products and orders, including placeOrder, getOrder, updateOrderStatus functions, and hardcoded product data for earbuds and smartwatches.",
  "feature_evidence.json": "Feature evidence report documenting the WhatsApp notification button feature in OrderConfirmation component that sends pre-filled order details to phone number 9919031626.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend component files, describing their UI responsibilities, state management, and styling with orange-blue theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining orange and blue themed design tokens for the application.",
  "frontend/index.html": "HTML entry point for the Zayora application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React component managing view state (home, checkout, confirmation) and orchestrating navigation between AnnouncementBanner, HeroSection, ProductShowcase, CheckoutForm, and OrderConfirmation components.",
  "frontend/src/components/AnnouncementBanner.tsx": "Scrolling banner component displaying Holi festival offer with animated text and real-time countdown timer showing hours, minutes, and seconds.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form component with customer detail inputs (name, phone, address), validation, order summary with MRP and delivery charge breakdown, and order placement handling.",
  "frontend/src/components/ComingSoonSection.tsx": "Coming soon section announcing future Blinkit partnership with blue-orange gradient background and Blinkit logo display.",
  "frontend/src/components/ContactFooter.tsx": "Footer component displaying brand information, contact details (phone, WhatsApp, email), quick navigation links, and copyright notice with app identifier tracking.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component with gradient background, brand name ZAYORA, founder attribution, and call-to-action buttons for exploring products and contacting.",
  "frontend/src/components/OrderConfirmation.tsx": "Order confirmation page that displays order details, customer information, product breakdown with delivery charges, and provides WhatsApp notification functionality for the merchant.",
  "frontend/src/components/PartnerLogos.tsx": "Section displaying logos of featured platforms (YouTube, Bharat Ke Founder, MX Player, PhonePe) in a responsive grid layout.",
  "frontend/src/components/ProductCard.tsx": "Product card component showing product image, name, price, features list, and a Cash on Delivery checkout button with availability status handling.",
  "frontend/src/components/ProductReviews.tsx": "Customer reviews section displaying 5 hardcoded testimonials with star ratings, customer names, and a badge showing 1000+ happy customers.",
  "frontend/src/components/ProductShowcase.tsx": "Product listing section that fetches and displays products in a grid using ProductCard components, with loading and error states.",
  "frontend/src/components/RestaurantSection.tsx": "Promotional section highlighting the company-owned restaurant 'ALL IS WELL .KANPUR' with gradient background and store icon.",
  "frontend/src/components/VideoSection.tsx": "Embedded YouTube video section displaying a promotional video about Zayora's story in a responsive iframe container.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Custom React hook that provides a 24-hour countdown timer that automatically resets, returning hours, minutes, and seconds for display.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication provider and hook that manages login state, identity persistence, and AuthClient lifecycle with configurable options for ICP authentication.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching products and orders, and placing orders through the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus scroll animation keyframes for the Zayora website.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (orange, blue) using OKLCH color space, extended theme tokens for UI components, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Project state document describing Zayora as an e-commerce website for tech products (earbuds, smartwatches) with orange/blue theme, featuring product showcase, partner logos, COD checkout, Holi promotion, and restaurant business section."
}